# DBeam_ShowBeamLines

```pascal
PROCEDURE DBeam_ShowBeamLines(showFlag : BOOLEAN);
```

```python
def vs.DBeam_ShowBeamLines(showFlag):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|showFlag|BOOLEAN|   |

## Examples
```pascal
DBeam_ShowBeamLines(TRUE);
```
```python
import vs

showFlag = True

vs.DBeam_ShowBeamLines(showFlag)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight